//  Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

//Принять число Number от пользователя
// Найти summ цифер в числе

int GetNumberByUser(string Number)
{
  Console.WriteLine("Введите число: ");
  string Number = Convert.ToInt32(Console.ReadLine());
}
int Number = GetNumberByUser();